---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.PipingFailures
source: html/315ce880-e60a-1af9-bdf9-09ac738260c6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures

Failures about Pipes.

## Syntax (C#)
```csharp
public static class PipingFailures
```